// Файл: MyProject_2/src/DataProcessors/ПолучениеКнигПоИздательству/Forms/Форма/Module.bsl

&НаКлиенте
Процедура ПолучитьКниги(Команда)
	
	Если ПустаяСтрока(Объект.ИздательствоИНН) Тогда
		
		//Исправить на сообщение пользователю		
		Сообщить("Введите издательство");
		Возврат;
		
	КонецЕсли;

	ЗаполнитьКнигиПоИздательствуНаСервере(Объект.ИздательствоИНН);

	Если Объект.ТаблицаКниг.Количество() = 0 Тогда
		
		Сообщить("Книги не найдены");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКнигиПоИздательствуНаСервере(ИздательствоИНН)
	
	Прокси = ПолучитьПроксиWS("BooksService");
	
	СписокКниг = Прокси.ПолучитьКнигиПоИздательству(ИздательствоИНН);	
	
	Объект.ТаблицаКниг.Очистить();
	
	Для каждого СтрокаРеестра Из СписокКниг.Книги Цикл
		
		НоваяСтрока = Объект.ТаблицаКниг.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРеестра);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроксиWS(ИмяСервиса)
	
	//http://localhost/II_1_RCH/ws/BooksService.1cws?wsdl
		
	ИмяПользователя = "ws";
	Пароль 			= "555";
	
	Определение = Новый WSОпределения("http://localhost/II_1_RCH/ws/BooksService.1cws?wsdl", ИмяПользователя, Пароль);
	
	Прокси = Новый WSПрокси(Определение, "http://www.roman.org", ИмяСервиса, ИмяСервиса + "Soap");
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль 		= Пароль;
	
	Возврат Прокси;
	
КонецФункции